tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1566_tdd.h
#define SSP2CON2_RSEN                 522
#define SSP2CON2_PEN                  523
#define SSP2CON2_RCEN                 524
#define SSP2CON2_ACKEN                525
#define SSP2CON2_ACKDT                526
#define SSP2CON2_ACKSTAT              527
#define SSP2CON2_GCEN                 528
#define SSP2CON3                      529
#define SSP2CON3_DHEN                 530
#define SSP2CON3_AHEN                 531
#define SSP2CON3_SBCDE                532
#define SSP2CON3_SDAHT                533
#define SSP2CON3_BOEN                 534
#define SSP2CON3_SCIE                 535
#define SSP2CON3_PCIE                 536
#define SSP2CON3_ACKTIM               537
#define IOCBP                         538
#define IOCBP0                        539
#define IOCBP1                        540
#define IOCBP2                        541
#define IOCBP3                        542
#define IOCBP4                        543
#define IOCBP5                        544
#define IOCBP6                        545
#define IOCBP7                        546
#define IOCBN0                        547
#define IOCBN                         548
#define IOCBN1                        549
#define IOCBN2                        550
#define IOCBN3                        551
#define IOCBN4                        552
#define IOCBN5                        553
#define IOCBN6                        554
#define IOCBN7                        555
#define IOCBF0                        556
#define IOCBF                         557
#define IOCBF1                        558
#define IOCBF2                        559
#define IOCBF3                        560
#define IOCBF4                        561
#define IOCBF5                        562
#define IOCBF6                        563
#define IOCBF7                        564
#define TMR4                          565
#define PR4                           566
#define T4CON                         567
#define T4CKPS0                       568
#define T4CKPS                        569
#define T4CKPS1                       570
#define TMR4ON                        571
#define T4OUTPS                       572
#define T4OUTPS0                      573
#define T4OUTPS1                      574
#define T4OUTPS2                      575
#define T4OUTPS3                      576
#define PWM1DCL                       577
#define PWM1DCL0                      578
#define PWM1DCL1                      579
#define PWM1DCH                       580
#define PWM1DCH0                      581
#define PWM1DCH1                      582
#define PWM1DCH2                      583
#define PWM1DCH3                      584
#define PWM1DCH4                      585
#define PWM1DCH5                      586
#define PWM1DCH6                      587
#define PWM1DCH7                      588
#define PWM1CON                       589
#define PWM1POL                       590
#define PWM1OUT                       591
#define PWM1CON_PWM1OE                592
#define PWM1EN                        593
#define PWM2DCL0                      594
#define PWM2DCL                       595
#define PWM2DCL1                      596
#define PWM2DCH0                      597
#define PWM2DCH                       598
#define PWM2DCH1                      599
#define PWM2DCH2                      600
#define PWM2DCH3                      601
#define PWM2DCH4                      602
#define PWM2DCH5                      603
#define PWM2DCH6                      604
#define PWM2DCH7                      605
#define PWM2CON                       606
#define PWM2POL                       607
#define PWM2OUT                       608
#define PWM2CON_PWM2OE                609
#define PWM2EN                        610
#define PWMTMRS                       611
#define P1TSEL                        612
#define P2TSEL                        613
#define PWM1AOE                       614
#define PWM1OE0                       615
#define PWM1AOE_PWM1OE                616
#define PWM1OE1                       617
#define PWM1OE2                       618
#define PWM1OE3                       619
#define PWM2AOE                       620
#define PWM2OE0                       621
#define PWM2AOE_PWM2OE                622
#define PWM2OE1                       623
#define PWM2OE2                       624
#define PWM2OE3                       625
#define ADCTX                         626
#define A1TX0                         627
#define A1TX1                         628
#define A1TX2                         629
#define A2TX0                         630
#define A2TX1                         631
#define A2TX2                         632
#define AD1TX0                        633
#define TX10                          634
#define TX11                          635
#define TX12                          636
#define TX13                          637
#define TX14                          638
#define TX15                          639
#define TX16                          640
#define TX17                          641
#define AD1TX1                        642
#define TX18                          643
#define TX19                          644
#define AD2TX0                        645
#define TX20                          646
#define TX21                          647
#define TX22                          648
#define TX23                          649
#define TX24                          650
#define TX25                          651
#define TX26                          652
#define TX27                          653
#define AD2TX1                        654
#define TX28                          655
#define TX29                          656
#define TX40                          657
#define AD1CON0                       658
#define AD1CON0_AD1ON                 659
#define AD1CON0_ADON                  660
#define AD1CON0_GO                    661
#define GO_nDONE1                     662
#define AD1CON0_GO_nDONE              663
#define AD1CON0_CHS0                  664
#define AD1CON0_CHS                   665
#define AD1CON0_CHS1                  666
#define AD1CON0_CHS2                  667
#define AD1CON0_CHS3                  668
#define AD1CON0_CHS4                  669
#define AD1CON0_CHS5                  670
#define ADCOMCON                      671
#define ADCOMCON_ADPREF               672
#define ADCOMCON_ADPREF0              673
#define ADCOMCON_ADPREF1              674
#define ADCOMCON_GO_nDONE_ALL         675
#define ADCOMCON_GO_ALL               676
#define ADCOMCON_ADNREF               677
#define ADCS0                         678
#define ADCOMCON_ADCS                 679
#define ADCS1                         680
#define ADCS2                         681
#define ADCOMCON_ADFM                 682
#define AD1CON2                       683
#define AD1CON2_TRIGSEL               684
#define AD1CON2_TRIGSEL0              685
#define AD1CON2_TRIGSEL1              686
#define AD1CON2_TRIGSEL2              687
#define AD1CON3                       688
#define AD1DSEN                       689
#define AD1CON3_ADDSEN                690
#define AD1IPEN                       691
#define AD1CON3_ADIPEN                692
#define AD1CON3_ADIPPOL               693
#define AD1IPPOL                      694
#define AD1EPPOL                      695
#define AD1CON3_ADEPPOL               696
#define ADSTAT                        697
#define AD1STG0                       698
#define ADSTG                         699
#define AD1STG                        700
#define AD1STG1                       701
#define AD1CONV                       702
#define ADCONV                        703
#define AD2STG0                       704
#define AD2STG                        705
#define AD2STG1                       706
#define AD2CONV                       707
#define AD1PRECON                     708
#define AD1PRECON_ADPRE               709
#define AD1PRECON_ADPRE0              710
#define AD1PRECON_ADPRE1              711
#define AD1PRECON_ADPRE2              712
#define AD1PRECON_ADPRE3              713
#define AD1PRECON_ADPRE4              714
#define AD1PRECON_ADPRE5              715
#define AD1PRECON_ADPRE6              716
#define AD1ACQCON                     717
#define AD1ACQCON_ADACQ0              718
#define AD1ACQCON_ADACQ               719
#define AD1ACQCON_ADACQ1              720
#define AD1ACQCON_ADACQ2              721
#define AD1ACQCON_ADACQ3              722
#define AD1ACQCON_ADACQ4              723
#define AD1ACQCON_ADACQ5              724
#define AD1ACQCON_ADACQ6              725
#define AD1GRD                        726
#define TX1POL                        727
#define AD1GRD_TXPOL                  728
#define GRD1POL                       729
#define AD1GRD_GRDPOL                 730
#define AD1GRD_GRDAOE                 731
#define GRD1AOE                       732
#define GRD1BOE                       733
#define AD1GRD_GRDBOE                 734
#define AD1CAPCON                     735
#define AD1CAPCON_ADDCAP              736
#define ADD1CAP                       737
#define AD1CAPCON_ADDCAP0             738
#define AD1CAPCON_ADCAP               739
#define AD1CAPCON_ADDCAP1             740
#define AD1CAPCON_ADDCAP2             741
#define AD1CAPCON_ADDCAP3             742
#define AAD1RES0L                     743
#define AAD1RES0L_ADRESL              744
#define AAD1RES0H                     745
#define AAD1RES0H_ADRESH              746
#define AAD1RES1L                     747
#define AAD1RES1L_ADRESL              748
#define AAD1RES1H                     749
#define AAD1RES1H_ADRESH              750
#define AD1CH0                        751
#define CH10                          752
#define CH11                          753
#define CH12                          754
#define CH13                          755
#define CH14                          756
#define CH15                          757
#define CH16                          758
#define CHS17                         759
#define AD1CH1                        760
#define CH18                          761
#define CH19                          762
#define AD2CON0                       763
#define AD2ON                         764
#define AD2CON0_ADON                  765
#define GO_nDONE2                     766
#define AD2CON0_GO                    767
#define AD2CON0_GO_nDONE              768
#define AD2CON0_CHS                   769
#define AD2CON0_CHS0                  770
#define AD2CON0_CHS1                  771
#define AD2CON0_CHS2                  772
#define AD2CON0_CHS3                  773
#define AD2CON0_CHS4                  774
#define AD2CON0_CHS5                  775
#define AD2CON2                       776
#define AD2CON2_TRIGSEL0              777
#define AD2CON2_TRIGSEL               778
#define AD2CON2_TRIGSEL1              779
#define AD2CON2_TRIGSEL2              780
#define AD2CON3                       781
#define AD2CON3_ADDSEN                782
#define AD2DSEN                       783
#define AD2IPEN                       784
#define AD2CON3_ADIPEN                785
#define AD2IPPOL                      786
#define AD2CON3_ADIPPOL               787
#define AD2CON3_ADEPPOL               788
#define AD2EPPOL                      789
#define AD2PRECON                     790
#define AD2PRECON_ADPRE0              791
#define AD2PRECON_ADPRE               792
#define AD2PRECON_ADPRE1              793
#define AD2PRECON_ADPRE2              794
#define AD2PRECON_ADPRE3              795
#define AD2PRECON_ADPRE4              796
#define AD2PRECON_ADPRE5              797
#define AD2PRECON_ADPRE6              798
#define AD2ACQCON                     799
#define AD2ACQCON_ADACQ0              800
#define AD2ACQCON_ADACQ               801
#define AD2ACQCON_ADACQ1              802
#define AD2ACQCON_ADACQ2              803
#define AD2ACQCON_ADACQ3              804
#define AD2ACQCON_ADACQ4              805
#define AD2ACQCON_ADACQ5              806
#define AD2ACQCON_ADACQ6              807
#define AD2GRD                        808
#define AD2GRD_TXPOL                  809
#define TX2POL                        810
#define AD2GRD_GRDPOL                 811
#define GRD2POL                       812
#define AD2GRD_GRDAOE                 813
#define GRD2AOE                       814
#define AD2GRD_GRDBOE                 815
#define GRD2BOE                       816
#define AD2CAPCON                     817
#define AD2CAPCON_ADDCAP              818
#define AD2CAPCON_ADCAP               819
#define ADD2CAP                       820
#define AD2CAPCON_ADDCAP0             821
#define AD2CAPCON_ADDCAP1             822
#define AD2CAPCON_ADDCAP2             823
#define AD2CAPCON_ADDCAP3             824
#define AAD2RES0L                     825
#define AAD2RES0L_ADRESL              826
#define AAD2RES0H                     827
#define AAD2RES0H_ADRESH              828
#define AAD2RES1L                     829
#define AAD2RES1L_ADRESL              830
#define AAD2RES1H                     831
#define AAD2RES1H_ADRESH              832
#define AD2CH0                        833
#define CH20                          834
#define CH21                          835
#define CH22                          836
#define CH23                          837
#define CH24                          838
#define CH25                          839
#define CH26                          840
#define CH27                          841
#define AD2CH1                        842
#define CH28                          843
#define CH29                          844
#define CH40                          845
#define ICDIO                         846
#define TRIS_ICDCLK                   847
#define TRIS_ICDDAT                   848
#define LAT_ICDCLK                    849
#define LAT_ICDDAT                    850
#define PORT_ICDCLK                   851
#define PORT_ICDDAT                   852
#define ICDCON0                       853
#define RSTVEC                        854
#define DBGINEX                       855
#define SSTEP                         856
#define FREEZ                         857
#define INBUG                         858
#define ICDSTAT                       859
#define USRHLTF                       860
#define TRP0HLTF                      861
#define TRP1HLTF                      862
#define ICDINSTL                      863
#define DBGIN0                        864
#define DBGIN1                        865
#define DBGIN2                        866
#define DBGIN3                        867
#define DBGIN4                        868
#define DBGIN5                        869
#define DBGIN6                        870
#define DBGIN7                        871
#define ICDINSTH                      872
#define DBGIN8                        873
#define DBGIN9                        874
#define DBGIN10                       875
#define DBGIN11                       876
#define DBGIN12                       877
#define DBGIN13                       878
#define ICDBK0CON                     879
#define BKHLT                         880
#define BKEN                          881
#define ICDBK0L                       882
#define BKA0                          883
#define BKA1                          884
#define BKA2                          885
#define BKA3                          886
#define BKA4                          887
#define BKA5                          888
#define BKA6                          889
#define BKA7                          890
#define ICDBK0H                       891
#define BKA8                          892
#define BKA9                          893
#define BKA10                         894
#define BKA11                         895
#define BKA12                         896
#define BKA13                         897
#define BKA14                         898
#define BSRICDSHAD                    899
#define BSR_ICDSHAD                   900
#define STATUS_SHAD                   901
#define C_SHAD                        902
#define DC_SHAD                       903
#define Z_SHAD                        904
#define WREG_SHAD                     905
#define BSR_SHAD                      906
#define PCLATH_SHAD                   907
#define FSR0L_SHAD                    908
#define FSR0H_SHAD                    909
#define FSR1L_SHAD                    910
#define FSR1H_SHAD                    911
#define STKPTR                        912
#define TOSL                          913
#define TOSH                          914

#endif // _PIC16LF1566_H_
